amodio.tsl-problem-matcher
anthropic.claude-code
christian-kohler.npm-intellisense
christian-kohler.path-intellisense
davidanson.vscode-markdownlint
dbaeumer.vscode-eslint
docker.docker
dotjoshjohnson.xml
eamodio.gitlens
editorconfig.editorconfig
esbenp.prettier-vscode
github.copilot
github.copilot-chat
hjb2012.vscode-es6-string-html
humao.rest-client
interactive-smartlog.interactive-smartlog
mikestead.dotenv
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-dotnettools.csdevkit
ms-dotnettools.csharp
ms-dotnettools.vscode-dotnet-runtime
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode-remote.remote-wsl
ms-vscode-remote.vscode-remote-extensionpack
ms-vscode.live-server
ms-vscode.powershell
ms-vscode.remote-explorer
ms-vscode.remote-server
pflannery.vscode-versionlens
piotrpalarz.vscode-gitignore-generator
rpinski.shebang-snippets
shd101wyy.markdown-preview-enhanced
vscode-icons-team.vscode-icons
vsls-contrib.gistfs
wix.vscode-import-cost
