amodio.tsl-problem-matcher
christian-kohler.npm-intellisense
christian-kohler.path-intellisense
davidanson.vscode-markdownlint
dbaeumer.vscode-eslint
eamodio.gitlens
editorconfig.editorconfig
esbenp.prettier-vscode
github.copilot
github.copilot-chat
hjb2012.vscode-es6-string-html
humao.rest-client
mikestead.dotenv
ms-azuretools.vscode-docker
ms-dotnettools.csharp
ms-dotnettools.vscode-dotnet-runtime
ms-vscode-remote.remote-containers
ms-vscode.live-server
ms-vscode.powershell
pflannery.vscode-versionlens
piotrpalarz.vscode-gitignore-generator
rpinski.shebang-snippets
vscode-icons-team.vscode-icons
vsls-contrib.gistfs
wix.vscode-import-cost
